/** ****************************************************************************************************
 * @file
 * @brief ステージのデータ操作関連
 **************************************************************************************************** */
#pragma once

#include "StagePieceData.h"

/** ****************************************************************************************************
 * @brief ステージのデータ操作関連
 **************************************************************************************************** */
namespace MySystem::StageData
{
	using WorldIndex = uint8;	//!< ワールド数設定用
	using StageIndex = uint8;	//!< ステージ数設定用

	/** ****************************************************************************************************
	 * @brief ステージのデータ格納用
	 **************************************************************************************************** */
	struct Desc
	{
		String stageName;
		Array<StagePieceData::Desc> aPieceDescs;

		/** ****************************************************************************************************
		 * @brief コンストラクタ
		 **************************************************************************************************** */
		inline Desc() noexcept :
			stageName{ U"DefaultName" }
		{

		}
	};

	/** ****************************************************************************************************
	 * @brief					ステージの読み込み
	 * @param[in] worldIndex	読み込むワールド番号
	 * @param[in] stageIndex	読み込むステージ番号
	 * @retval true				読み込めた
	 * @retval false			読み込めなかった
	 **************************************************************************************************** */
	bool Load(const WorldIndex worldIndex, const StageIndex stageIndex) noexcept;

	/** ****************************************************************************************************
	 * @brief					ステージの書き込み
	 * @param[in] worldIndex	書き込むワールド番号
	 * @param[in] stageIndex	書き込むステージ番号
	 * @retval true				書き込めた
	 * @retval false			書き込めなかった
	 **************************************************************************************************** */
	bool Save(const WorldIndex worldIndex, const StageIndex stageIndex) noexcept;

	/** ****************************************************************************************************
	 * @brief	現在読み込んでいるデータを取得
	 * @return	現在読み込んでいるデータ
	 **************************************************************************************************** */
	std::shared_ptr<Desc> GetCurrentData();
}


