/** ****************************************************************************************************
 * @file
 * @brief タイルのデータ操作関連
 **************************************************************************************************** */
#pragma once

#include <Siv3D.hpp>

/** ****************************************************************************************************
 * @brief タイルのデータ操作関連
 **************************************************************************************************** */
namespace MySystem::TileData
{
	using TypeIndex = uint8;	//!< タイルの種類用

	/** ****************************************************************************************************
	 * @brief タイルの種類
	 **************************************************************************************************** */
	enum class Type : TypeIndex
	{
		Rect,		//!< 矩形タイル
		Triangle,	//!< 三角形タイル
		Max
	};

	static constexpr double	gTILE_SIZE = 30.0;		//!< タイルの大きさ
	static constexpr Point	gUV_CELL_NUM{ 16, 32 }; //!< タイルテクスチャの分割数
	static const String		gTEXTURE_PATH = U"Assets/Image/Tile.png";	//!< テクスチャのパス

	/** ****************************************************************************************************
	 * @brief タイルのデータ格納用
	 **************************************************************************************************** */
	struct Desc
	{
		Vec2 position;	//!< 表示座標
		double angle;	//!< 表示角度
		Point uv;		//!< UV開始位置

		TypeIndex tileType;	//!< タイルの種類

		/** ****************************************************************************************************
		 * @brief コンストラクタ
		 **************************************************************************************************** */
		inline Desc() noexcept :
			position{ Vec2{ 0.0, 0.0 } },
			angle{ 0.0 },
			uv{ Point{ 0, 0 } },
			tileType{ static_cast<TypeIndex>(0) }
		{

		}
	};

	/** ****************************************************************************************************
	 * @brief						ポリゴンから出来るだけ重複している頂点を削除する
	 * @param[out] targets			対象のポリゴン
	 * @param[in] nearPointDistance	同じ位置とみなす距離
	 * @param[in] nearLineDistance	同じ線状とみなす距離
	 **************************************************************************************************** */
	void GetSimplePolygon(Array<Polygon>& targets, double nearPointDistance, double nearLineDistance);

	/** ****************************************************************************************************
	 * @brief						頂点群から出来るだけ重複している頂点を削除する
	 * @param[out] targets			対象の頂点群
	 * @param[in] nearPointDistance	同じ位置とみなす距離
	 * @param[in] nearLineDistance	同じ線状とみなす距離
	 **************************************************************************************************** */
	Array<Vec2> GetSimpleVertex(Array<Vec2> targets, double nearPointDistance, double nearLineDistance);
}

